SOA/WSDLs/CheckIn.wsdl

<?xml version = '1.0' encoding = 'UTF-8'?>
<definitions targetNamespace="http://www.stellent.com/CheckIn/" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:s0="http://www.stellent.com/CheckIn/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">     <types>         <s:schema targetNamespace="http://www.stellent.com/CheckIn/" elementFormDefault="qualified">             <s:element name="CheckInUniversal">                 <s:complexType>                     <s:sequence>                         <s:element type="s:string" minOccurs="0" name="dDocName" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocTitle" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocType" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocAuthor" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dSecurityGroup" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocAccount" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="CustomDocMetaData" maxOccurs="1"/>                         <s:element type="s0:IdcFile" minOccurs="0" name="primaryFile" maxOccurs="1"/>                         <s:element type="s0:IdcFile" minOccurs="0" name="alternateFile" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="extraProps" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:element name="CheckInUniversalResponse">                 <s:complexType>                     <s:sequence>                         <s:element type="s0:CheckInUniversalResult" minOccurs="0" name="CheckInUniversalResult" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:complexType name="CheckInUniversalResult">                 <s:sequence>                     <s:element type="s:int" minOccurs="0" name="dID" maxOccurs="1"/>                     <s:element type="s:int" minOccurs="0" name="dRevisionID" maxOccurs="1"/>                     <s:element type="s:int" minOccurs="0" name="dRevClassID" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dRevLabel" maxOccurs="1"/>                     <s:element type="s0:StatusInfo" minOccurs="0" name="StatusInfo" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:element name="CheckOut">                 <s:complexType>                     <s:sequence>                         <s:element type="s:int" minOccurs="0" name="dID" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="extraProps" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:element name="CheckOutResponse">                 <s:complexType>                     <s:sequence>                         <s:element type="s0:CheckOutResult" minOccurs="0" name="CheckOutResult" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:complexType name="CheckOutResult">                 <s:sequence>                     <s:element type="s0:StatusInfo" minOccurs="0" name="StatusInfo" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:element name="CheckOutByName">                 <s:complexType>                     <s:sequence>                         <s:element type="s:string" minOccurs="0" name="dDocName" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="extraProps" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:element name="CheckOutByNameResponse">                 <s:complexType>                     <s:sequence>                         <s:element type="s0:CheckOutByNameResult" minOccurs="0" name="CheckOutByNameResult" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:complexType name="CheckOutByNameResult">                 <s:sequence>                     <s:element type="s0:StatusInfo" minOccurs="0" name="StatusInfo" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:element name="UndoCheckOut">                 <s:complexType>                     <s:sequence>                         <s:element type="s:int" minOccurs="0" name="dID" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="extraProps" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:element name="UndoCheckOutResponse">                 <s:complexType>                     <s:sequence>                         <s:element type="s0:UndoCheckOutResult" minOccurs="0" name="UndoCheckOutResult" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:complexType name="UndoCheckOutResult">                 <s:sequence>                     <s:element type="s0:StatusInfo" minOccurs="0" name="StatusInfo" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:element name="UndoCheckOutByName">                 <s:complexType>                     <s:sequence>                         <s:element type="s:string" minOccurs="0" name="dDocName" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="extraProps" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:element name="UndoCheckOutByNameResponse">                 <s:complexType>                     <s:sequence>                         <s:element type="s0:UndoCheckOutByNameResult" minOccurs="0" name="UndoCheckOutByNameResult" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:complexType name="UndoCheckOutByNameResult">                 <s:sequence>                     <s:element type="s0:StatusInfo" minOccurs="0" name="StatusInfo" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:element name="UpdateDocInfo">                 <s:complexType>                     <s:sequence>                         <s:element type="s:int" minOccurs="0" name="dID" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dRevLabel" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocName" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocTitle" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocType" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocAuthor" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dSecurityGroup" maxOccurs="1"/>                         <s:element type="s:string" minOccurs="0" name="dDocAccount" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="CustomDocMetaData" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="extraProps" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:element name="UpdateDocInfoResponse">                 <s:complexType>                     <s:sequence>                         <s:element type="s0:UpdateDocInfoResult" minOccurs="0" name="UpdateDocInfoResult" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:complexType name="UpdateDocInfoResult">                 <s:sequence>                     <s:element type="s0:StatusInfo" minOccurs="0" name="StatusInfo" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:element name="CheckInList">                 <s:complexType>                     <s:sequence>                         <s:element type="s:boolean" minOccurs="0" name="userOnly" maxOccurs="1"/>                         <s:element type="s0:IdcPropertyList" minOccurs="0" name="extraProps" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:element name="CheckInListResponse">                 <s:complexType>                     <s:sequence>                         <s:element type="s0:CheckInListResult" minOccurs="0" name="CheckInListResult" maxOccurs="1"/>                     </s:sequence>                 </s:complexType>             </s:element>             <s:complexType name="CheckInListResult">                 <s:sequence>                     <s:element type="s0:CheckInList" minOccurs="0" name="CheckInList" maxOccurs="unbounded"/>                     <s:element type="s0:StatusInfo" minOccurs="0" name="StatusInfo" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:complexType name="CheckInList">                 <s:sequence>                     <s:element type="s:string" minOccurs="0" name="dDocName" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dDocTitle" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dDocType" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dDocAuthor" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dSecurityGroup" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dDocAccount" maxOccurs="1"/>                     <s:element type="s:int" minOccurs="0" name="dID" maxOccurs="1"/>                     <s:element type="s:int" minOccurs="0" name="dRevClassID" maxOccurs="1"/>                     <s:element type="s:int" minOccurs="0" name="dRevisionID" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dRevLabel" maxOccurs="1"/>                     <s:element type="s:boolean" minOccurs="0" name="dIsCheckedOut" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dCheckoutUser" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dCreateDate" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dInDate" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dOutDate" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dStatus" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dReleaseState" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dFlag1" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dWebExtension" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dProcessingState" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dMessage" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dReleaseDate" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dRendition1" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dRendition2" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dIndexerState" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dPublishType" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="dPublishState" maxOccurs="1"/>                     <s:element type="s0:IdcPropertyList" minOccurs="0" name="CustomDocMetaData" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:complexType name="StatusInfo">                 <s:sequence>                     <s:element type="s:int" minOccurs="0" name="statusCode" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="statusMessage" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:complexType name="IdcPropertyList">                 <s:sequence>                     <s:element type="s0:IdcProperty" minOccurs="0" name="property" maxOccurs="unbounded"/>                 </s:sequence>             </s:complexType>             <s:complexType name="IdcProperty">                 <s:sequence>                     <s:element type="s:string" minOccurs="0" name="name" maxOccurs="1"/>                     <s:element type="s:string" minOccurs="0" name="value" maxOccurs="1"/>                 </s:sequence>             </s:complexType>             <s:complexType name="IdcFile">                 <s:sequence>                     <s:element type="s:string" minOccurs="0" name="fileName" maxOccurs="1"/>                     <s:element type="s:base64Binary" minOccurs="0" name="fileContent" maxOccurs="1"/>                 </s:sequence>             </s:complexType>         </s:schema>     </types>     <message name="CheckInUniversalSoapIn">         <part element="s0:CheckInUniversal" name="parameters"/>     </message>     <message name="CheckInUniversalSoapOut">         <part element="s0:CheckInUniversalResponse" name="parameters"/>     </message>     <message name="CheckOutSoapIn">         <part element="s0:CheckOut" name="parameters"/>     </message>     <message name="CheckOutSoapOut">         <part element="s0:CheckOutResponse" name="parameters"/>     </message>     <message name="CheckOutByNameSoapIn">         <part element="s0:CheckOutByName" name="parameters"/>     </message>     <message name="CheckOutByNameSoapOut">         <part element="s0:CheckOutByNameResponse" name="parameters"/>     </message>     <message name="UndoCheckOutSoapIn">         <part element="s0:UndoCheckOut" name="parameters"/>     </message>     <message name="UndoCheckOutSoapOut">         <part element="s0:UndoCheckOutResponse" name="parameters"/>     </message>     <message name="UndoCheckOutByNameSoapIn">         <part element="s0:UndoCheckOutByName" name="parameters"/>     </message>     <message name="UndoCheckOutByNameSoapOut">         <part element="s0:UndoCheckOutByNameResponse" name="parameters"/>     </message>     <message name="UpdateDocInfoSoapIn">         <part element="s0:UpdateDocInfo" name="parameters"/>     </message>     <message name="UpdateDocInfoSoapOut">         <part element="s0:UpdateDocInfoResponse" name="parameters"/>     </message>     <message name="CheckInListSoapIn">         <part element="s0:CheckInList" name="parameters"/>     </message>     <message name="CheckInListSoapOut">         <part element="s0:CheckInListResponse" name="parameters"/>     </message>     <portType name="CheckInSoap">         <operation name="CheckInUniversal">             <input message="s0:CheckInUniversalSoapIn"/>             <output message="s0:CheckInUniversalSoapOut"/>         </operation>         <operation name="CheckOut">             <input message="s0:CheckOutSoapIn"/>             <output message="s0:CheckOutSoapOut"/>         </operation>         <operation name="CheckOutByName">             <input message="s0:CheckOutByNameSoapIn"/>             <output message="s0:CheckOutByNameSoapOut"/>         </operation>         <operation name="UndoCheckOut">             <input message="s0:UndoCheckOutSoapIn"/>             <output message="s0:UndoCheckOutSoapOut"/>         </operation>         <operation name="UndoCheckOutByName">             <input message="s0:UndoCheckOutByNameSoapIn"/>             <output message="s0:UndoCheckOutByNameSoapOut"/>         </operation>         <operation name="UpdateDocInfo">             <input message="s0:UpdateDocInfoSoapIn"/>             <output message="s0:UpdateDocInfoSoapOut"/>         </operation>         <operation name="CheckInList">             <input message="s0:CheckInListSoapIn"/>             <output message="s0:CheckInListSoapOut"/>         </operation>     </portType>     <binding type="s0:CheckInSoap" name="CheckInSoap">         <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>         <operation name="CheckInUniversal">             <soap:operation style="document" soapAction="http://www.stellent.com/CheckIn/"/>             <input>                 <soap:body use="literal"/>             </input>             <output>                 <soap:body use="literal"/>             </output>         </operation>         <operation name="CheckOut">             <soap:operation style="document" soapAction="http://www.stellent.com/CheckIn/"/>             <input>                 <soap:body use="literal"/>             </input>             <output>                 <soap:body use="literal"/>             </output>         </operation>         <operation name="CheckOutByName">             <soap:operation style="document" soapAction="http://www.stellent.com/CheckIn/"/>             <input>                 <soap:body use="literal"/>             </input>             <output>                 <soap:body use="literal"/>             </output>         </operation>         <operation name="UndoCheckOut">             <soap:operation style="document" soapAction="http://www.stellent.com/CheckIn/"/>             <input>                 <soap:body use="literal"/>             </input>             <output>                 <soap:body use="literal"/>             </output>         </operation>         <operation name="UndoCheckOutByName">             <soap:operation style="document" soapAction="http://www.stellent.com/CheckIn/"/>             <input>                 <soap:body use="literal"/>             </input>             <output>                 <soap:body use="literal"/>             </output>         </operation>         <operation name="UpdateDocInfo">             <soap:operation style="document" soapAction="http://www.stellent.com/CheckIn/"/>             <input>                 <soap:body use="literal"/>             </input>             <output>                 <soap:body use="literal"/>             </output>         </operation>         <operation name="CheckInList">             <soap:operation style="document" soapAction="http://www.stellent.com/CheckIn/"/>             <input>                 <soap:body use="literal"/>             </input>             <output>                 <soap:body use="literal"/>             </output>         </operation>     </binding>     <service name="CheckIn">         <port binding="s0:CheckInSoap" name="CheckInSoap">             <soap:address location="http://ucmdes.senasa.gob.pe/senasa/idcplg"/>         </port>     </service> </definitions>